{
  "view-live": "View Live",
  "view-playstore": "Play Store",
  "view-source": "View Source",
  "view-image": "View full-size image",
  "more-info": "More Info",
  "less-info": "Less Info",
  "ratepad": {
    "title": "RatePad",
    "description": "Android home screen widget for currency conversion with calculator-style interface. 31 currencies, 5 themes, offline support.",
    "detailedInfo": "RatePad is a practical side project that I built after failing to find a currency converter widget for Android that matched my needs. Prior to this project, I had only very limited experience with Kotlin, so I used AI-assisted development tools to help bootstrap the codebase and speed up implementation. Through this project, I gained hands-on experience with Android widget development, background updates, offline-first design, and publishing an app on the Google Play Store. It lowered the barrier for me to take on more mobile-focused projects in the future."
  },
  "finnhopper": {
    "title": "Finnhopper",
    "description": "A browser-based platformer game that combines classic side-scrolling gameplay with word-building mechanics using the Finnish language.",
    "detailedInfo": "Finnhopper is a playful side project where I built my own 2D platformer from scratch. The game mixes fast-paced platforming with Finnish word formation. This project was heavily AI-assisted: I used AI coding tools to speed up development and AI image generation to prototype the visual style, then refined and finalized the graphics manually. It was also my first hands-on experience with the Phaser game framework, which proved to be an enjoyable and flexible tool for building browser-based games."
  },
  "semanttuli": {
    "title": "Semanttuli",
    "description": "Finnish version of the [Semantle](https://semantle.com) word guessing game. Also available as an Android app from [Google Play Store](https://play.google.com/store/apps/details?id=com.herokuapp.semanttuli.twa).",
    "detailedInfo": "Semanttuli is a word-guessing game where players try to find a secret word by entering guesses. The game uses word2vec, an NLP technique, to compute semantic similarity between the guessed words and the target word. Instead of giving binary \"hot or cold\" feedback, Semanttuli provides a numerical score indicating how semantically close each guess is to the secret word, making for a unique and challenging word puzzle experience."
  },
  "portfolio": {
    "title": "This portfolio",
    "description": "My first project with NextJS, Tailwind CSS, MDX and Figma.",
    "detailedInfo": "This portfolio showcases my skills and projects using modern web technologies. It was designed in Figma and implemented using Next.js for server-side rendering, Tailwind CSS for styling, and MDX for content management."
  },
  "semanttuli-legacy": {
    "title": "Semanttuli (legacy version)",
    "description": "Old version of Semanttuli. The user interface is made with raw HMTL, JavaScript and CSS.",
    "detailedInfo": "This old version of Semanttuli is a fork of an old version of [Semantle](https://semantle.com) created by [David Turner](https://games.novalis.org/). ***This version is no longer maintained***. A new version has since been developed, featuring significant improvements in the user interface, backend code, and word vector quality."
  },
  "revita": {
    "title": "Revita",
    "description": "For a year, I was part of the [Toska](https://toska.dev) development team, where I contributed as a frontend developer to Revita, an established language learning platform.",
    "detailedInfo": "Revita is an AI-based application for language learning and supporting endangered languages. It can create exercises from user-uploaded text materials, provide precise feedback on user responses, and continuously assess the user's skill level."
  }
}
